<template>
  <section class="hero is-primary is-fullheight">
    <div style="background-color: rgb(121, 87, 213)">
      <div class="pb-3 pt-3"></div>
      <section
        class="hero is-white is-fullheight"
        style="border-radius: 60px 60px 0 0; padding: 1rem"
      >
        <div>
          <form class="box">
            <div>
              <div class="content has-text-black" style="text-align: center; padding: 0.5rem">
                <br />
                <strong
                  ><h2 style="margin-bottom: 0.5rem">
                    เอกสารชี้แจงผู้เข้าร่วมการทดลองใช้งานเว็บแอพลิเคชัน
                  </h2></strong
                >
                <strong
                  ><h4 style="margin-bottom: 0.5rem">(PARTICIPANT INFORMATION SHEET)</h4></strong
                >

                <!-- <p>&emsp; This is a four spaces gap</p> -->
              </div>
              <!-- text -->
              <div class="content is-normal">
                <dd>
                  <strong>
                    ในเอกสารนี้อาจมีข้อความที่ท่านอ่านแล้วยังไม่เข้าใจ โปรดสอบถามหัวหน้าโครงการวิจัย
                    หรือผู้แทนให้ช่วยอธิบายจนกว่าจะเข้าใจดี ท่านอาจขอเอกสารนี้กลับไปอ่านที่บ้าน
                    เพื่อปรึกษาหารือกับญาติพี่น้อง เพื่อนสนิท แพทย์ประจำตัวของท่าน หรือแพทย์ท่านอื่น
                    เพื่อช่วยในการตัดสินใจ เข้าร่วมการวิจัย
                  </strong>
                </dd>
                <br />
                <dt><strong>ชื่อโครงการ</strong></dt>
                <dd>
                  เว็บแอพลิเคชันสําหรับเก็บข้อมูลการได้รับยาเพื่อวิเคราะห์การเกิดปฏิกิริยาระหว่างยาที่ได้รับกับยาวาร์ฟาริน
                </dd>
                <dd>
                  Web Application for Collecting Medication Data to Analyses Drug Interaction with
                  Warfarin
                </dd>
                <br />
                <dt><strong>หัวหน้าโครงการวิจัย</strong></dt>
                <dd>ภญ.ดร. วิมลฉัตร ตั้งอมรสุขสันต์</dd>
                <dt><strong>สถานที่ทำการวิจัยย</strong></dt>
                <ol>
                  <li>วิทยาลัยแพทยศาสตร์ศรีสวางควัฒน ราชวิทยาลัยจุฬาภรณ์</li>
                  <li>โรงพยาบาลจุฬาภรณ์</li>
                  <li>
                    ภาควิชาวิศวกรรมคอมพิวเตอร์ คณะวิศวกรรมศาสตร์
                    มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี
                  </li>
                </ol>
                <dt><strong>วัตถุประสงค์ของโครงการวิจัย </strong></dt>
                <ol>
                  <li>
                    เพื่อพัฒนาเว็บแอพลิเคชันที่สามารถตรวจหาการเกิดปฏิกิริยาระหว่างยาที่ได้รับกับยาวาร์ฟาริน
                  </li>
                  <li>
                    เพื่อจัดเก็บข้อมูลประวัติการได้รับยาของผู้ป่วยเพื่อเป็นข้อมูลประกอบการตัดสินใจในการรักษาและ
                    การสั่งจ่ายยาของบุคคลากรทางการแพทย์
                  </li>
                  <li>เพื่อลดความคลาดเคลื่อนในการให้ข้อมูลกับบุคคลากรทางการแพทย์</li>
                  <li>เพื่อประเมินประสิทธิภาพและความพึงพอใจของเว็บแอพลิเคชันในกลุ่มเป้าหมาย</li>
                </ol>
                <dt><strong>ประโยชน์ที่คาดว่าจะได้รับ</strong></dt>
                <ol>
                  <li>
                    ผู้ใช้งานสามารถทราบถึงการเกิดปฏิกิริยาระหว่างยาที่ได้รับกับยาวาร์ฟารินได้
                    ผ่านการบันทึกรายการภายในเว็บแอพลิเคชัน
                  </li>
                  <li>
                    ผู้ใช้งานสามารถจัดเก็บข้อมูลเกี่ยวกับรายการยาที่ได้รับ และรายการยาที่มีอาการแพ้
                    หรือรูปภาพใบแพ้ยา รวมถึงค่า INR (ถ้ามี) ไว้ภายในโทรศัพท์เพียงเครื่องเดียว
                  </li>
                  <li>ลดความคลาดเคลื่อนในการให้ข้อมูลกับบุคคลากรทางการแพทย์</li>
                </ol>
                <dd>
                  ท่านได้รับเชิญให้เข้าร่วมการวิจัยนี้เพราะ
                  ท่านได้มีการใช้ยาในการรักษาอาการป่วยอย่างสม่ำเสมอ หรือ
                  ท่านได้มีการใช้ยาวาร์ฟารินในการรักษา หรือมีการเก็บบันทึกค่า INR ในการรักษา
                  หรือท่านมีอาการของโรคเรื่อรังที่ต้องรับประทานยาอย่างต่อเนื่อง
                  เนื่องจากโครงการวิจัยนี้เป็นโครงการวิจัยที่จะให้ท่านบันทึกรายการยาที่ท่านได้รับผ่านทางเว็บแอพลิเคชัน
                  เพื่อเป็นเป็นการเก็บบันทึกข้อมูลในการได้รับยาของท่านเอง
                  จะมีผู้เข้าร่วมการวิจัยนี้ทั้งสิ้น ประมาณ 20 คน ระยะเวลาที่จะทำวิจัยทั้งสิ้น 12
                  เดือน โดยจะทำการสัมภาษณ์ผู้เข้าร่วมวิจัย 1 ครั้ง/ท่าน โดยใช้เวลาครั้งละ 30-45 นาที
                  ในเดือนที่ 11 ของการทำโครงการวิจัย หากท่านตัดสินใจเข้าร่วมการวิจัยแล้ว
                  จะมีขั้นตอนการวิจัยดังต่อไปนี้คือ
                </dd>
                <ol>
                  <li>
                    ท่านจะต้องทำการทดลองใช้เว็บแอพลิเคชันสําหรับเก็บข้อมูลการได้รับยาเพื่อวิเคราะห์การเกิดปฏิกิริยาระหว่างยาที่ได้รับกับยาวาร์ฟาริน
                    ผ่านทางโทรศัพท์มือถือของท่านที่เชื่อมต่อกับระบบอินเทอร์เน็ต
                  </li>
                  <li>ท่านจะต้องทำการลงทะเบียนเข้าใช้งาน เพื่อเข้าใช้งานเว็บแอพลิเคชัน</li>
                  <li>
                    ท่านจะต้องทำการทดลองใช้งาน เช่น การบันทึกข้อมูลรายการยาที่ท่านได้รับในการรักษา
                    การบันทึกการแพ้ยา หรือการบันทึกภาพใบแพ้ยาของท่าน การบันทึกค่า INR (ถ้ามี)
                    เพื่อใช้ในการแสดง Dashboard
                  </li>
                  <li>
                    หลังจากที่ท่านทดลองใช้งานเว็บแอพลิเคชันแล้ว ท่านจะต้องทำแบบประเมินความพึงพอใจ
                    และการใช้งานเว็บแอพลิเคชันนี้
                  </li>
                </ol>
                <br />
                <dd>
                  หากมีข้อสงสัยต้องการสอบถามเกี่ยวกับการวิจัย หรือมีอาการบาดเจ็บ
                  หรือเจ็บป่วยจากการวิจัย สามารถติดต่อกับผู้วิจัยได้ที่ นางสาวกรรณ์วิญา ภิลัยวัลย์
                  ที่วิทยาลัยแพทยศาสตร์ศรีสวางควัฒน ราชวิทยาลัยจุฬาภรณ์ หรือ นางสาวอิสรีย์
                  สุวรรณสมบัติที่วิทยาลัยแพทยศาสตร์ศรีสวางควัฒน ราชวิทยาลัยจุฬาภรณ์
                </dd>
                <br />
                <dd>
                  หากมีข้อมูลเพิ่มเติมทั้งด้านประโยชน์และโทษที่เกี่ยวข้องกับการวิจัยนี้
                  ผู้วิจัยจะแจ้งให้ทราบโดยรวดเร็วไม่ปิดบังข้อมูลส่วนตัวของผู้เข้าร่วมการวิจัยเป็นรายบุคคลอาจมีคณะบุคคลบางกลุ่มเข้ามาตรวจสอบได้
                  เช่นผู้ให้ทุนวิจัย สถาบัน หรือองค์กรของรัฐที่มีหน้าที่ตรวจสอบ
                  คณะกรรมการจริยธรรมการวิจัยในคนฯ เป็นต้น
                  ผู้เข้าร่วมการวิจัยมีสิทธิ์ถอนตัวออกจากโครงการวิจัยเมื่อใดก็ได้
                  โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                  และการไม่เข้าร่วมการวิจัยหรือถอนตัวออกจากโครงการวิจัยนี้จะไม่มีผลกระทบต่อการบริการและการรักษาที่สมควรจะได้รับแต่ประการใด
                </dd>
                <br />
                <dd>
                  หากท่านได้รับการปฏิบัติที่ไม่ตรงตามที่ได้ระบุไว้ในเอกสารชี้แจงนี้
                  ท่านจะสามารถแจ้งให้ประธานคณะกรรมการจริยธรรมการวิจัยในคน สถาบันวิจัยจุฬาภรณ์ หรือ
                  สำนักงานคณะกรรมการจริยธรรมการวิจัยในคน สถาบันวิจัยจุฬาภรณ์ ทราบได้ที่ ชั้น 4 ฝั่ง
                  C-D อาคารบริหาร 2 บริษัท กสท โทรคมนาคม จำกัด (มหาชน) โทร 02-5766000 ต่อ 8431, 8432
                  (ในเวลาราชการ)
                </dd>
              </div>
              <!-- checkbox -->
              <div>
                <b-field>
                  <b-checkbox v-model="isDisable" type="is-primary" size="is-medium" required>
                    ข้าพเจ้าได้อ่านรายละเอียดในเอกสารนี้ครบถ้วนแล้ว
                  </b-checkbox>
                </b-field>
              </div>
              <div
                class="fixedbuttons"
                style="justify-content: center; margin-top: 2.5rem; margin-bottom: 6rem"
              >
                <router-link to="/home">
                  <b-button
                    rounded
                    type="is-primary"
                    size="is-medium"
                    expanded
                    :disabled="!isDisable"
                  >
                    เสร็จสิ้น</b-button
                  ></router-link
                >
              </div>
            </div>
          </form>
        </div>
      </section>
    </div>
  </section>
</template>

<script>
export default {
  name: 'RegisterPrivacyPage',
  data() {
    return {
      isDisable: false,
    };
  },
};
</script>

<style>
.input {
  margin-bottom: 0.5rem;
}
</style>
